org/emacs/emacs.org
#+TITLE:emacs
#+KEYWORDS: emacs
#+OPTIONS: H:2 toc:3 num:3 ^:nil
#+LANGUAGE: zh-CN
#+AUTHOR: ChrisChen
#+EMAIL: ChrisChen3121@gmail.com
#+SETUPFILE: ../../org-templates/level-1.org
* 安装配置
** Windows
*** 环境变量，设置 HOME，值[.emacs 所在目录路径]
*** Mapping Caps lock to Ctrl
#+begin_example
    修改注册表项，重启
    Windows Registry Editor Version 5.00

    [HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layout]
    "Scancode Map"=hex:00,00,00,00,00,00,00,00,02,00,00,00,1d,00,3a,00, 00,00,00,00
#+end_example

** Linux 中文输入法
#+BEGIN_VERSE
执行以下操作：
sudo add-apt-repository ppa:irie/elisp
sudo apt-get update
sudo apt-get install ibus-el
#+END_VERSE
emacs 配置文件中加
#+begin_src elisp
(require 'ibus)
;; Turn on ibus-mode automatically after loading .emacs
(add-hook 'after-init-hook 'ibus-mode-on)
#+end_src

* 文件编码问题
#+BEGIN_SRC elisp
  (set-language-environment 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-clipboard-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-buffer-file-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (modify-coding-system-alist 'process "*" 'utf-8)
  (setq default-process-coding-system
        '(utf-8 . utf-8))
  (setq-default pathname-coding-system 'utf-8)
#+END_SRC

* 键盘宏
  #+BEGIN_VERSE
  C-( C-)
  C-x e 执行宏
  #+END_VERSE

* 图片支持 on windows
图片支持库列表
M-x: image-library-alist RET

是否支持某种图片格式：
(image-type-available-p 'png)

下载地址：
http://vgoulet.act.ulaval.ca/en/emacs/windows/
or
https://github.com/jixiuf/emacs_conf

调整图片位置
#+begin_src org
#+ATTR_HTML: alt="Image" style="margin:0px 150px"
#+end_src

* 启动调试错误位置
  #+BEGIN_VERSE
  buffer postion
  C-x = ：获取当前位置
  M-x goto-char pos：跳转到 pos
  #+END_VERSE

* 开发环境
** C
*** CEDET
*** yasnippet
*** Auto-Complete
*** flymake
需要在 makefile 中增加检查语法的规则：
#+BEGIN_SRC makefile
  check-syntax:
      g++ -o nul -S ${CHK_SOURCES}
#+END_SRC

** Python
   #+BEGIN_VERSE
   有用工具：
   flymake 语法检查
   pycomplete 更强大的 python 补全工具
   rope and ropemacs 重构 跳转工具
   pdb 调试
   #+END_VERSE
