emacs/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2018-08-16 Thu 09:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="emacs" />

<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />

</head>
<body>
<div id="content">
<h1 class="title">emacs</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd40d15b">1. 安装配置</a>
<ul>
<li><a href="#org07f0ea3">1.1. Windows</a></li>
<li><a href="#orgfb4ea4c">1.2. Linux 中文输入法</a></li>
</ul>
</li>
<li><a href="#orgde130c5">2. 文件编码问题</a></li>
<li><a href="#orgf1d2bb5">3. 键盘宏</a></li>
<li><a href="#orgd92d00c">4. 图片支持 on windows</a></li>
<li><a href="#orgce6479d">5. 启动调试错误位置</a></li>
<li><a href="#org8660591">6. 开发环境</a>
<ul>
<li><a href="#orgf87cac9">6.1. C</a></li>
<li><a href="#org5e3163c">6.2. Python</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd40d15b" class="outline-2">
<h2 id="orgd40d15b"><span class="section-number-2">1</span> 安装配置</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org07f0ea3" class="outline-3">
<h3 id="org07f0ea3"><span class="section-number-3">1.1</span> Windows</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<ol class="org-ol">
<li><a id="org1596f1e"></a>环境变量，设置 HOME，值[.emacs 所在目录路径]<br /></li>
<li><a id="org267e75b"></a>Mapping Caps lock to Ctrl<br />
<div class="outline-text-4" id="text-1-1-2">
<pre class="example">
修改注册表项，重启
Windows Registry Editor Version 5.00

[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layout]
"Scancode Map"=hex:00,00,00,00,00,00,00,00,02,00,00,00,1d,00,3a,00, 00,00,00,00
</pre>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgfb4ea4c" class="outline-3">
<h3 id="orgfb4ea4c"><span class="section-number-3">1.2</span> Linux 中文输入法</h3>
<div class="outline-text-3" id="text-1-2">
<p class="verse">
执行以下操作：<br />
sudo add-apt-repository ppa:irie/elisp<br />
sudo apt-get update<br />
sudo apt-get install ibus-el<br />
</p>
<p>
emacs 配置文件中加
</p>
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">require</span> '<span style="color: #4e3163;">ibus</span><span style="color: #3a81c3;">)</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Turn on ibus-mode automatically after loading .emacs</span>
<span style="color: #3a81c3;">(</span>add-hook 'after-init-hook 'ibus-mode-on<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgde130c5" class="outline-2">
<h2 id="orgde130c5"><span class="section-number-2">2</span> 文件编码问题</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #3a81c3;">(</span>set-language-environment 'utf-8<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>set-keyboard-coding-system 'utf-8<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>set-clipboard-coding-system 'utf-8<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>set-terminal-coding-system 'utf-8<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>set-buffer-file-coding-system 'utf-8<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>set-selection-coding-system 'utf-8<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>modify-coding-system-alist 'process <span style="color: #2d9574;">"*"</span> 'utf-8<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>setq default-process-coding-system
      '<span style="color: #6c3163;">(</span>utf-8 . utf-8<span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>setq-default pathname-coding-system 'utf-8<span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf1d2bb5" class="outline-2">
<h2 id="orgf1d2bb5"><span class="section-number-2">3</span> 键盘宏</h2>
<div class="outline-text-2" id="text-3">
<p class="verse">
C-( C-)<br />
C-x e 执行宏<br />
</p>
</div>
</div>

<div id="outline-container-orgd92d00c" class="outline-2">
<h2 id="orgd92d00c"><span class="section-number-2">4</span> 图片支持 on windows</h2>
<div class="outline-text-2" id="text-4">
<p>
图片支持库列表
M-x: image-library-alist RET
</p>

<p>
是否支持某种图片格式：
(image-type-available-p 'png)
</p>

<p>
下载地址：
<a href="http://vgoulet.act.ulaval.ca/en/emacs/windows/">http://vgoulet.act.ulaval.ca/en/emacs/windows/</a>
or
<a href="https://github.com/jixiuf/emacs_conf">https://github.com/jixiuf/emacs_conf</a>
</p>

<p>
调整图片位置
</p>
<div class="org-src-container">
<pre class="src src-org"><span style="color: #da8b55;">#+ATTR_HTML: alt="Image" style="margin:0px 150px"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce6479d" class="outline-2">
<h2 id="orgce6479d"><span class="section-number-2">5</span> 启动调试错误位置</h2>
<div class="outline-text-2" id="text-5">
<p class="verse">
buffer postion<br />
C-x = ：获取当前位置<br />
M-x goto-char pos：跳转到 pos<br />
</p>
</div>
</div>

<div id="outline-container-org8660591" class="outline-2">
<h2 id="org8660591"><span class="section-number-2">6</span> 开发环境</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgf87cac9" class="outline-3">
<h3 id="orgf87cac9"><span class="section-number-3">6.1</span> C</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<ol class="org-ol">
<li><a id="org8ce282d"></a>CEDET<br /></li>
<li><a id="org45239c3"></a>yasnippet<br /></li>
<li><a id="org6cc402c"></a>Auto-Complete<br /></li>
<li><a id="org3635f6c"></a>flymake<br />
<div class="outline-text-4" id="text-6-1-4">
<p>
需要在 makefile 中增加检查语法的规则：
</p>
<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #6c3163; font-weight: bold;">check-syntax</span>:
    g++ -o nul -S $<span style="color: #3a81c3;">{</span><span style="color: #715ab1;">CHK_SOURCES</span><span style="color: #3a81c3;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org5e3163c" class="outline-3">
<h3 id="org5e3163c"><span class="section-number-3">6.2</span> Python</h3>
<div class="outline-text-3" id="text-6-2">
<p class="verse">
有用工具：<br />
flymake 语法检查<br />
pycomplete 更强大的 python 补全工具<br />
rope and ropemacs 重构 跳转工具<br />
pdb 调试<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
